# Домашнее задание - 3
# Задача-2

# Напишите программу, которая найдёт произведение пар чисел списка. 
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.

# Пример:

# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]
# [2, 3, 5, 6, 2, 3, 4, 5, 6, 2, 3, 4, 5, 6]

list = [2, 3, 5, 6, 2, 3, 4, 5, 6, 2, 3, 4, 5, 6]
list2 = [] 
i=0
# print(f' len(list)/2 = {len(list)/2}')
while i < len(list)/2:
    x = list[i]*list[len(list)-1-i]
    list2.append(x)
    i+=1
print(f'{list} => {list2}')





